# Command Docs: https://docs.brew.sh/Manpage#bundle-subcommand
# File Format Docs: https://thoughtbot.com/blog/brewfile-a-gemfile-but-for-homebrew

# Taps
tap 'homebrew/cask-fonts'

# Formulae
brew 'curl'                       # https://curl.se/
brew 'wget'                       # https://www.gnu.org/software/wget/
brew 'tree'                       # http://mama.indstate.edu/users/ice/tree/
brew 'tldr'                       # https://tldr.sh/
brew 'coreutils'                  # https://www.gnu.org/software/coreutils
brew 'git'
brew 'github-keygen'              # https://github.com/dolmen/github-keygen
brew 'node'
brew 'yarn'
brew 'romkatv/powerlevel10k/powerlevel10k'
brew 'zsh-syntax-highlighting'

# Casks
cask 'iterm2'
cask 'visual-studio-code'
#-------------------------------------------
# Browsers
# See the README for a list of recommended browser extensions to install.
#-------------------------------------------
cask 'google-chrome'                     # https://www.google.com/chrome/
cask 'firefox'                           # https://blog.mozilla.org/en/category/products/firefox/
cask 'microsoft-edge'                    # https://www.microsoft.com/en-us/edge

#-------------------------------------------
# Password Manager
#-------------------------------------------
cask '1password'
cask '1password-cli'

#-------------------------------------------
# Communication
#-------------------------------------------
cask 'slack'
cask 'discord'

#-------------------------------------------
# Notes, Docs, Screen Capture
#-------------------------------------------
cask 'slite'
cask 'kap'
cask 'droplr'

#-------------------------------------------
# File Storage
#-------------------------------------------
cask 'google-drive'

#-------------------------------------------
# Graphics
#-------------------------------------------
cask 'inkscape'

#-------------------------------------------
# Music/Video
#-------------------------------------------
cask 'spotify'
cask 'vlc'

#-------------------------------------------
# Productivity
#-------------------------------------------
cask 'rectangle'
cask 'cheatsheet'
cask 'flycut'
cask 'coffitivity-offline'

#-------------------------------------------
# Dev Tools
#-------------------------------------------
cask 'github'
cask 'postman'
cask 'cyberduck'

#-------------------------------------------
# FONTS
# brew search --casks /font-/ | less
#-------------------------------------------
cask 'font-meslo-for-powerline'
cask 'font-jetbrains-mono'
cask 'font-fira-code'

#-------------------------------------------
# QuickLook Extensions
#-------------------------------------------
cask 'qlcolorcode'     #QL Syntax Highligher
cask 'qlmarkdown'      #QL Markdown files
cask 'quicklook-json'  #QL JSON files
cask 'quicklook-csv'   #QL CSV files
cask 'WebPQuickLook'   #WebP files