# Command Docs: https://docs.brew.sh/Manpage#bundle-subcommand
# File Format Docs: https://thoughtbot.com/blog/brewfile-a-gemfile-but-for-homebrew

# Taps
tap 'homebrew/cask-fonts'
tap 'romkatv/powerlevel10k'

#-------------------------------------------
# System Utilities
#-------------------------------------------
brew 'asdf'                                  # https://asdf-vm.com/
brew 'curl'                                  # https://curl.se/
brew 'wget'                                  # https://www.gnu.org/software/wget/
brew 'tree'                                  # http://mama.indstate.edu/users/ice/tree/
brew 'tldr'                                  # https://tldr.sh/
brew 'coreutils'                             # https://www.gnu.org/software/coreutils
brew 'shellcheck'                            # https://github.com/Homebrew/homebrew-core/blob/HEAD/Formula/shellcheck.rb
brew 'noti'                                  # https://github.com/variadico/noti - Trigger notifications when a process completes
brew 'trash'                                 # https://hasseg.org/trash/ - CLI tool that moves files or folder to the trash
brew 'lorem'                                 # https://github.com/per9000/lorem - Lorem ipsum generator for console

#-------------------------------------------
# Terminal and IDE
#-------------------------------------------
cask 'iterm2'                                # https://iterm2.com/ - MacOs Terminal replacement
brew 'romkatv/powerlevel10k/powerlevel10k'   # https://github.com/romkatv/powerlevel10k
brew 'zsh-syntax-highlighting'
cask 'visual-studio-code'                    # https://code.visualstudio.com/docs

#-------------------------------------------
# Git Version Control
#-------------------------------------------
brew 'git'
brew 'gh'                                    # https://cli.github.com/manual/gh - Github CLI
brew 'git-delta'                             # https://github.com/dandavison/delta

#-------------------------------------------
# Browsers
# See the README for a list of recommended browser extensions to install.
#-------------------------------------------
cask 'google-chrome'                        # https://www.google.com/chrome/
#cask 'firefox'                              # https://blog.mozilla.org/en/category/products/firefox/
#cask 'microsoft-edge'                       # https://www.microsoft.com/en-us/edge
#brew 'defaultbrowser'                       # https://github.com/kerma/defaultbrowser - Set your default browser from the command line

#-------------------------------------------
# Password Manager
#-------------------------------------------
cask '1password'
cask '1password-cli'

#-------------------------------------------
# Communication
#-------------------------------------------
cask 'slack'
#cask 'discord'
cask 'zoom'                                 # https://www.zoom.us/ - Video communication and virtual meeting platform
cask 'microsoft-teams'                      # https://teams.microsoft.com/downloads - Meet, chat, call, and collaborate in just one place

#-------------------------------------------
# Notes, Docs, Screen Capture
#-------------------------------------------
cask 'kap'                                  # https://getkap.co/ - Open source screen recorder
cask 'keycastr'                             # https://github.com/keycastr/keycastr - Show shortcuts and clicks in recordings
brew 'asciinema'                            # https://asciinema.org/ - Record your terminal
#cask 'todoist'                              # https://todoist.com/ - To-Do list
#cask 'notion'                               # https://www.notion.so/ - App to write, plan, collaborate, and get organized
cask 'obsidian'                             # https://obsidian.md/ - Knowledge base that works on top of a local folder of plain text Markdown files

#-------------------------------------------
# File Storage
#-------------------------------------------
cask 'google-drive'                         # https://www.google.com/drive/ - Client for the Google Drive storage service
cask 'dropbox'                              # https://www.dropbox.com/ - Client for the Dropbox cloud storage service

#-------------------------------------------
# Graphics
#-------------------------------------------
#cask 'inkscape'                             # https://inkscape.org/ - Vector graphics editor
#cask 'sketch@77'                            # https://github.com/philipdowner/homebrew-sketch77 - Sketch app
#cask 'imageoptim'                           # https://imageoptim.com/mac - Tool to optimize images to a smaller size
#brew 'imageoptim-cli'                       # https://jamiemason.github.io/ImageOptim-CLI/ - CLI for ImageOptim, ImageAlpha and JPEGmini

#-------------------------------------------
# Music/Video
#-------------------------------------------
cask 'spotify'
#cask 'vlc'                                  # https://www.videolan.org/vlc/ - Cross-platform media player

#-------------------------------------------
# Productivity
#-------------------------------------------
cask 'rectangle'                            # https://rectangleapp.com/ - Window size and placement manager
cask 'cheatsheet'                           # https://www.mediaatelier.com/CheatSheet/ - Keyboard shortcut visualizer
cask 'flycut'                               # https://github.com/TermiT/Flycut - Clean and simple clipboard manager for developers
cask 'coffitivity-offline'                  # https://coffitivity.com/ - Ambient noise generator
#cask 'alfred'                               # https://www.alfredapp.com/ - Application launcher and productivity software

#-------------------------------------------
# Dev Tools
#-------------------------------------------
cask 'docker'                               # https://www.docker.com/products/docker-desktop - Build and share containerized applications and microservices
cask 'github'                               # https://desktop.github.com/ - Git GUI
cask 'postman'                              # https://www.postman.com/ - API testing and exploration software
cask 'cyberduck'                            # https://cyberduck.io/ - FTP Client
cask 'dbeaver-community'                    # https://dbeaver.io/ - Universal database tool and SQL client
#cask 'mysqlworkbench'                       # https://www.mysql.com/products/workbench/ - Visual tool to design, develop and administer MySQL servers

#-------------------------------------------
# Languages - PHP
#-------------------------------------------
brew 'php@8.4'                              # https://www.php.net/ - General-purpose scripting language
brew 'composer'                             # https://getcomposer.org/ - Dependency Manager for PHP

#-------------------------------------------
# FONTS
# brew search --casks /font-/ | less
#-------------------------------------------
cask 'font-meslo-for-powerline'
cask 'font-jetbrains-mono'
cask 'font-fira-code'

#-------------------------------------------
# QuickLook Extensions
#-------------------------------------------
cask 'qlmarkdown'                           # Markdown files
cask 'quicklook-json'                       # JSON files
cask 'quicklook-csv'                        # CSV files
cask 'WebPQuickLook'                        # WebP files

#-------------------------------------------
# Gaming
# Because not everything can be work!
#-------------------------------------------
#cask 'steam'                                # https://store.steampowered.com/about/ - Video game digital distribution service
